app/Helpers/SystemSettings_helper.php

    function get_system_timezone()
    {
        $CI = \Config\Database::connect();
        $builder = $CI->table('tbl_settings');
        $res = $builder->where('type', 'system_timezone')->get()->getResult();
---
SELECT *
FROM `tbl_settings`
WHERE `type` = 'system_timezone'

    function is_category_enabled()
    {
        $CI = \Config\Database::connect();
        $builder = $CI->table('tbl_settings');
        $res = $builder->where('type', 'category_mode')->get()->getResult();
---
SELECT *
FROM `tbl_settings`
WHERE `type` = 'category_mode'

    function is_breaking_news_enabled()
    {
        $CI = \Config\Database::connect();
        $builder = $CI->table('tbl_settings');
        $res = $builder->where('type', 'breaking_news_mode')->get()->getResult();
---
SELECT *
FROM `tbl_settings`
WHERE `type` = 'breaking_news_mode'