app/Controllers/Dashboard.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);
        $this->session = \Config\Services::session();
        $this->session->start();
        $this->helpers = helper('SystemSettings');
        date_default_timezone_set(get_system_timezone());
        $this->Category_Model = new Category_Model();
        $this->News_Model = new News_Model();
        $this->Notification_Model = new Notification_Model();
        $this->Setting_Model = new Setting_Model();
        $this->WebSettings_Model = new WebSettings_Model();
        $this->UserRoles_Model = new UserRoles_Model();
        $this->db = \Config\Database::connect();
        $this->today = date('Y-m-d');
        $this->data['app_name'] = $this->db->table('tbl_settings')->where('type', 'app_name')->get()->getResult();
        $this->data['app_logo'] = $this->db->table('tbl_settings')->where('type', 'app_logo')->get()->getResult();
        $this->data['app_logo_full'] = $this->db->table('tbl_settings')->where('type', 'app_logo_full')->get()->getResult();
        $res = $this->db->table('tbl_settings')->where('type', 'jwt_key')->get()->getResult();
---
SELECT *
FROM `tbl_settings`
WHERE `type` = 'app_name'
SELECT *
FROM `tbl_settings`
WHERE `type` = 'app_logo'
SELECT *
FROM `tbl_settings`
WHERE `type` = 'app_logo_full'
SELECT *
FROM `tbl_settings`
WHERE `type` = 'jwt_key'